{
  "kind": "build_request",
  "title": "Clinical Training & MCQ Assessment Platform (Admin-approved content, scoring, certificates, audit logs)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement role-based authentication using Internet Identity, with three roles: Therapist, Doctor, and Clinical Trainer (Admin). Enforce authorization checks for all protected actions (admin-only content/exam management; learner-only exam attempts; both learner roles can consume published training).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "The platform will be used by: 1. Therapists ... 2. Doctors ... 3. Clinical trainers (admin users)",
          "Auth: Role-based login"
        ]
      },
      "acceptanceCriteria": [
        "Users can sign in via Internet Identity and obtain an app session reflecting a persisted role.",
        "Admin-only pages/actions are blocked for non-admin users (UI hides controls; backend rejects calls).",
        "Therapist/Doctor users can access learner features but cannot create/approve/publish content or exams.",
        "Role assignment/change is restricted to Admin users (or first-run bootstrap admin) and is persisted in the backend."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Build an admin content management workflow for training materials where all learner-visible content is admin-approved before going live. Support uploading PDFs and organizing them into courses and modules, with statuses (Draft, In Review, Published, Archived).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Content comes only from uploaded PDFs and training material",
          "All content must be admin-approved before live"
        ]
      },
      "acceptanceCriteria": [
        "Admin can create/edit courses and modules and attach uploaded PDF files to modules.",
        "Non-admin users cannot upload or modify training materials.",
        "Modules/courses marked Draft/In Review are not visible in the learner catalog.",
        "Published content is visible to learners and accessible only through the app UI (no hidden draft URLs).",
        "Only PDFs (and explicitly allowed supporting file types, if any) are accepted; rejected uploads show an English error message."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Create learner-facing training delivery UI: course catalog, course detail with module list, PDF viewer for module content, and progress tracking per user (e.g., Not Started/In Progress/Completed).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Digital training delivery",
          "Scalable training for large groups"
        ]
      },
      "acceptanceCriteria": [
        "Learners can browse a catalog of Published courses and open course details.",
        "Learners can open a module and view its PDF in-app.",
        "User progress is saved per module and reflected in the UI after reload/sign-in.",
        "Progress data is isolated per user and cannot be read/modified by other learners."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Implement an MCQ-only assessment engine with fully objective auto-evaluation (no free text, no manual grading). Admins can create exams with questions and answer options, set passing thresholds, and publish exams only after approval/publish step.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Online tests",
          "Automatic evaluation",
          "Auto-evaluation must be objective (MCQs only)",
          "No manual test correction"
        ]
      },
      "acceptanceCriteria": [
        "Admin can create/edit exams, questions, and choices; each question has one correct option (or a clearly defined objective scoring rule if multi-select is supported).",
        "Learners can start an exam attempt, answer questions, submit once, and receive an objective score computed by the backend.",
        "The backend stores attempt details (timestamps, answers, score, pass/fail) and returns them to the UI.",
        "No UI or API supports free-text answers or manual overrides of scoring."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add certification issuance based on assessment outcomes. When a learner meets the configured passing criteria, generate a verifiable certificate record and provide a downloadable/printable certificate view that includes learner name/identifier, course/exam name, issue date, and a unique certificate ID.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Certification generation",
          "Score generation"
        ]
      },
      "acceptanceCriteria": [
        "Certificate is issued only after a passed attempt (per configured threshold) for a Published exam/course.",
        "Each certificate has a unique ID and is stored in the backend with immutable issuance fields (issue date, recipient, exam/course reference).",
        "Learner can view their certificates list and open a certificate detail page suitable for printing/downloading.",
        "Admin can view certificates issued and search/filter by learner/exam/course."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Implement comprehensive audit logging for compliance and safety. Log user actions including authentication events, content access (course/module opens), exam lifecycle (start/submit/score), certificate issuance, and all admin changes (create/edit/approve/publish/archive). Provide an admin-only audit log viewer with filtering.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "System must log user actions",
          "System must be safe for medical training"
        ]
      },
      "acceptanceCriteria": [
        "Backend records audit events with: timestamp, principal/user ID, role, action type, entity type/id, and minimal relevant metadata.",
        "Audit logs are append-only from the app perspective (no edit/delete UI).",
        "Admin UI can filter logs by date range, user, action type, and entity type.",
        "Key events are logged: sign-in/out, publish actions, module view events, exam attempt submit/score events, certificate issuance."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Add safety/compliance guardrails in the product UX: clearly state that the platform provides training materials only (no medical advice), ensure all learner-facing content is sourced only from admin-uploaded materials, and prevent any feature that could generate medical recommendations or AI-authored content.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "System must be safe for medical training",
          "No AI-generated medical advice",
          "Content comes only from uploaded PDFs and training material"
        ]
      },
      "acceptanceCriteria": [
        "All learner-facing training pages include a concise disclaimer in English (no medical advice; training-only).",
        "There is no UI for generating content; all displayed training content is sourced from stored admin uploads and metadata.",
        "MCQ feedback (if any) is limited to objective results (correct/incorrect/score) and does not provide medical guidance."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Define and implement a deployment-ready Internet Computer project structure within the provided React + Motoko template: clear module boundaries for auth/roles, content management, exams/attempts, certificates, and audit logs; plus typed frontend API bindings and React Query integration for all data fetching/mutations.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Deployment-ready structure",
          "Now design the complete system architecture, folder structure, database schema, and API flow."
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a documented set of canister methods for: role management, course/module CRUD + publish, file upload/download, exam CRUD + publish, attempts create/submit/get, certificates list/get, and audit logs list.",
        "Frontend uses React Query for server state (queries/mutations) and handles loading/error states consistently.",
        "A concise architecture document is added to the repo describing: data model (in-canister persistent storage), method list (API flow), and folder structure for frontend/backend within the template constraints."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Create a coherent, professional visual theme for a medical training platform and apply it consistently across the app (typography, spacing, component styling, and layout). Avoid blue/purple as primary brand colors.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Build a web-based Clinical Training and Online Assessment Platform"
        ]
      },
      "acceptanceCriteria": [
        "App has a consistent theme (e.g., neutral + clinical accent colors) applied to navigation, cards, tables, forms, and status badges (Draft/Published/Passed/Failed).",
        "UI uses accessible contrast and clear hierarchy suitable for professional clinical users.",
        "No primary blue/purple theme is used unless later requested."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Render generated static images (logo and certificate background) from frontend/public/assets/generated and use them in the UI (app header/login and certificate view).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Certification generation"
        ]
      },
      "acceptanceCriteria": [
        "Generated images are present under frontend/public/assets/generated with the exact filenames specified.",
        "App header/login uses the generated logo asset.",
        "Certificate view uses the generated certificate background asset and remains printable/readable."
      ]
    }
  ],
  "constraints": [
    "Backend must be implemented in Motoko as a single-actor canister (no FastAPI, no PostgreSQL).",
    "Use Internet Identity for authentication; do not integrate third-party auth providers.",
    "Do not edit files under frontend/src/components/ui or any other immutable paths listed in SYSTEM_CONTEXT; compose them instead.",
    "No AI-generated medical advice or content generation features; training content must come only from admin-uploaded materials.",
    "Auto-evaluation must be purely objective (MCQs only) and require no manual correction.",
    "All learner-visible content and exams must require explicit admin approval/publish before becoming visible.",
    "All significant user/admin actions must be logged."
  ],
  "nonGoals": [
    "Integrating Python FastAPI, external REST APIs, or any external database (e.g., PostgreSQL).",
    "Free-text questions, subjective grading, or manual score adjustments.",
    "Real-time features (WebSockets/live proctoring/chat).",
    "Third-party identity providers beyond Internet Identity.",
    "Email/SMS delivery of certificates or notifications."
  ],
  "imageRequirements": {
    "required": [
      "Minimal clinical brand logo mark, neutral/green palette (app-logo.dim_512x512.png)",
      "Printable certificate background with subtle geometric medical aesthetic, light neutral tones, ample whitespace (certificate-bg.dim_2480x3508.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for all user-facing text."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}
